# Panda Series

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [13]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10, 'b':20, 'c':30}

In [14]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [15]:
pd.Series(data = my_data, index = labels )

a    10
b    20
c    30
dtype: int64

In [16]:
pd.Series(my_data, labels)

a    10
b    20
c    30
dtype: int64

In [17]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int32

In [18]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [19]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [20]:
pd.Series(data = [sum, print, len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [21]:
ser1 = pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])

In [22]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [23]:
ser2 = pd.Series([1,2,5,4],['USA','Germany','Italy','Japan'])

In [24]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [25]:
ser1['USA']

1

In [26]:
ser3 = pd.Series(data = labels)

In [27]:
ser3

0    a
1    b
2    c
dtype: object

In [29]:
ser3[2]

'c'

In [33]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

# Data Frames

In [36]:
import numpy as np
import pandas as pd

In [37]:
from numpy.random import randn

In [38]:
np.random.seed(101) #to initialize the random number with a particular value

In [46]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'],['W','X','Y','Z'])

In [47]:
df

          W         X         Y         Z
A  0.221491 -0.855196  1.541990  0.666319
B -0.538235 -0.568581  1.407338  0.641806
C -0.905100 -0.391157  1.028293 -1.972605
D -0.866885  0.720788 -1.223082  1.606780
E -1.115710 -1.385379 -1.329660  0.041460

In [48]:
df['W']

A    0.221491
B   -0.538235
C   -0.905100
D   -0.866885
E   -1.115710
Name: W, dtype: float64

In [49]:
type(df['W'])

pandas.core.series.Series

In [50]:
type(df)

pandas.core.frame.DataFrame

In [51]:
df[['W','Z']]

          W         Z
A  0.221491  0.666319
B -0.538235  0.641806
C -0.905100 -1.972605
D -0.866885  1.606780
E -1.115710  0.041460

In [52]:
df['new'] = df['W'] + df['Y']

In [53]:
df

          W         X         Y         Z       new
A  0.221491 -0.855196  1.541990  0.666319  1.763481
B -0.538235 -0.568581  1.407338  0.641806  0.869104
C -0.905100 -0.391157  1.028293 -1.972605  0.123193
D -0.866885  0.720788 -1.223082  1.606780 -2.089967
E -1.115710 -1.385379 -1.329660  0.041460 -2.445370

In [55]:
df.drop('new', axis = 1)

          W         X         Y         Z
A  0.221491 -0.855196  1.541990  0.666319
B -0.538235 -0.568581  1.407338  0.641806
C -0.905100 -0.391157  1.028293 -1.972605
D -0.866885  0.720788 -1.223082  1.606780
E -1.115710 -1.385379 -1.329660  0.041460

In [56]:
df

          W         X         Y         Z       new
A  0.221491 -0.855196  1.541990  0.666319  1.763481
B -0.538235 -0.568581  1.407338  0.641806  0.869104
C -0.905100 -0.391157  1.028293 -1.972605  0.123193
D -0.866885  0.720788 -1.223082  1.606780 -2.089967
E -1.115710 -1.385379 -1.329660  0.041460 -2.445370

In [57]:
df.drop('new', axis = 1, inplace = True)

In [58]:
df

          W         X         Y         Z
A  0.221491 -0.855196  1.541990  0.666319
B -0.538235 -0.568581  1.407338  0.641806
C -0.905100 -0.391157  1.028293 -1.972605
D -0.866885  0.720788 -1.223082  1.606780
E -1.115710 -1.385379 -1.329660  0.041460

In [59]:
df.drop('E')

          W         X         Y         Z
A  0.221491 -0.855196  1.541990  0.666319
B -0.538235 -0.568581  1.407338  0.641806
C -0.905100 -0.391157  1.028293 -1.972605
D -0.866885  0.720788 -1.223082  1.606780

In [60]:
df.shape

(5, 4)

In [61]:
df.loc['A'] #to access rows in a panda dataframe and this also returns a series

W    0.221491
X   -0.855196
Y    1.541990
Z    0.666319
Name: A, dtype: float64

In [62]:
df.iloc[2] #based on the index of the rows(numerical based)

W   -0.905100
X   -0.391157
Y    1.028293
Z   -1.972605
Name: C, dtype: float64

In [64]:
df.loc['B','Y']

1.4073382479609386

In [65]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.221491  1.541990
B -0.538235  1.407338

# DataFrame 2

In [67]:
import numpy as np
import pandas as pd

In [68]:
df

          W         X         Y         Z
A  0.221491 -0.855196  1.541990  0.666319
B -0.538235 -0.568581  1.407338  0.641806
C -0.905100 -0.391157  1.028293 -1.972605
D -0.866885  0.720788 -1.223082  1.606780
E -1.115710 -1.385379 -1.329660  0.041460

In [70]:
booldf = df > 0

In [71]:
df[booldf]

          W         X         Y         Z
A  0.221491       NaN  1.541990  0.666319
B       NaN       NaN  1.407338  0.641806
C       NaN       NaN  1.028293       NaN
D       NaN  0.720788       NaN  1.606780
E       NaN       NaN       NaN  0.041460

In [72]:
df[df>0]

          W         X         Y         Z
A  0.221491       NaN  1.541990  0.666319
B       NaN       NaN  1.407338  0.641806
C       NaN       NaN  1.028293       NaN
D       NaN  0.720788       NaN  1.606780
E       NaN       NaN       NaN  0.041460

In [73]:
df

          W         X         Y         Z
A  0.221491 -0.855196  1.541990  0.666319
B -0.538235 -0.568581  1.407338  0.641806
C -0.905100 -0.391157  1.028293 -1.972605
D -0.866885  0.720788 -1.223082  1.606780
E -1.115710 -1.385379 -1.329660  0.041460

In [75]:
df['W'] > 0

A     True
B    False
C    False
D    False
E    False
Name: W, dtype: bool

In [77]:
 df[df['Y'] > 0]

          W         X         Y         Z
A  0.221491 -0.855196  1.541990  0.666319
B -0.538235 -0.568581  1.407338  0.641806
C -0.905100 -0.391157  1.028293 -1.972605

In [82]:
resultdf = df[ df['Y'] > 0]

In [83]:
resultdf

          W         X         Y         Z
A  0.221491 -0.855196  1.541990  0.666319
B -0.538235 -0.568581  1.407338  0.641806
C -0.905100 -0.391157  1.028293 -1.972605

In [84]:
resultdf['X']

A   -0.855196
B   -0.568581
C   -0.391157
Name: X, dtype: float64

In [85]:
df[df['Y'] > 0][['X','Y']]

          X         Y
A -0.855196  1.541990
B -0.568581  1.407338
C -0.391157  1.028293